app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "my article"], ["text", "this should be shown"], ["user_id", 2], ["created_at", "2018-10-16 21:10:58.344828"], ["updated_at", "2018-10-16 21:10:58.344828"]]
---
  def create
  	@article = Article.new(article_params)
    @article.user = current_user
  	if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "i am one "], ["text", "i am content"], ["updated_at", "2018-10-11 20:13:44.159312"], ["id", 1]]
---
  def update
  	@article = Article.find(params[:id])
    if @article.user_id == current_user.id
  	 if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
  	@article = Article.find(params[:id])
    if @article.user_id == current_user.id
  	 @article.destroy