app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.build(comment_params)
    @comment.user_id = current_user.id
    @comment.commenter = current_user.username
    @comment.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "article_id", "user_id", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "great"], ["article_id", 1], ["user_id", 2], ["commenter", "talha@gmail.com"], ["created_at", "2018-10-17 06:18:04.552732"], ["updated_at", "2018-10-17 06:18:04.552732"]]