app/controllers/sessions_controller.rb

  def create
  	@user = User.find_by(username: params[:user][:username], password: params[:user][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? LIMIT 1  [["username", "talha@gmail.com"], ["password", "12345"]]